Reflow-Soldering/Learn_bare_metal_driver_development_using_Embedded_C_MCU1/stm32f4xx_drivers/Src/011.I2C_MASTER_RX_TESTING.c
/*
 * 010.I2C_MASTER_TX_TESTING.c
 *
 *  Created on: Oct 13, 2025
 *      Author: user
 */

#include "stm32f407xx.h"
#include <string.h>
#include <stdio.h>

extern void initialise_monitor_handles();

#define MY_ADDRESS		0x61

#define SLAVE_ADDR		0x68

I2C_Handle_t	I2C1Handle;

void delay(void)
{
	for(uint32_t i = 0; i< 500000*2; i++);
}

//테스트 데이터
uint8_t rcv_buf[32];
//아두이노에 와이어 라이브러리에서는 한 번에 32바이트밖에 못보냄.
//그러므로 32바이트 이상을 보내려면 두 번 이상 나누어서 보내야 함.

/*
 * I2C1 초기화 함수
 */

//PB6 -> SCL
//PB7 - SDA
void I2C1_GPIOInit(void)
{
	GPIO_Handle_t	I2CPins;

	I2CPins.pGPIOx = GPIOB;
	I2CPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	I2CPins.GPIO_PinConfig.GPIO_PinOPType = OUTPUT_OP_TYPE_PUSH_PULL;
	I2CPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PU;
	I2CPins.GPIO_PinConfig.GPIO_AltFunMode = 4;
	I2CPins.GPIO_PinConfig.GPIO_PinSpeed = OUTPUT_SPD_HIGH;


	//scl pin config하기
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_6;
	GPIO_Init(&I2CPins);

	//sda pin config하기
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_7;
	GPIO_Init(&I2CPins);

}

void I2C1_Init(void)
{
	I2C1Handle.pI2Cx = I2C1;
	I2C1Handle.I2C_Config.I2C_AckControl = I2C_ACK_ENABLE;
	I2C1Handle.I2C_Config.I2C_DeviceAddress = MY_ADDRESS;
	I2C1Handle.I2C_Config.I2C_FMDutyCycle = I2C_FM_DUTY_2;
	I2C1Handle.I2C_Config.I2C_SCLSpeed = I2C_SCL_SPEED_SM;

	I2C_Init(&I2C1Handle);
}

void GPIO_ButtonInit(void)
{
	//버튼을 누르면 LED가 켜지고 떼면 꺼짐

	GPIO_Handle_t GpioButton;

	GpioButton.pGPIOx = GPIOA;
	GpioButton.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_0;
	GpioButton.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_INPUT;
	GpioButton.GPIO_PinConfig.GPIO_PinSpeed = OUTPUT_SPD_VERY_HIGH;
//	GpioButton.GPIO_PinConfig.GPIO_PinOPType = OUTPUT_OP_TYPE_PUSH_PULL; // 사용 안함
	GpioButton.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PP_PD;

	GPIO_Init(&GpioButton);
}

int main(void)
{


	uint8_t commandcode;

	uint8_t len;

	initialise_monitor_handles();

	printf("App is running\n");

	//버튼 초기화
	GPIO_ButtonInit();

	//i2c pin 초기화
	I2C1_GPIOInit();

	//i2c peripehral 초기화 -> 클럭 enable도 있는거임
	I2C1_Init();

	//i2c 장치 enable
	I2C_PeripheralControl(I2C1, ENABLE);

	//i2c ack enable
	//ack enable은 반드시 PE 비트가 1이 된 이후에 되어야한다.
	I2C_ManageAcking(I2C1, I2C_ACK_ENABLE);

	while(1)
	{
		//버튼 누를 때까지 대기
		while(!GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_0));

		//디바운스 딜레이
		delay();

		commandcode = 0x51;

		I2C_MasterSendData(&I2C1Handle, &commandcode, 1, SLAVE_ADDR, I2C_ENABLE_SR);

		I2C_MasterReceiveData(&I2C1Handle, &len, 1, SLAVE_ADDR, I2C_ENABLE_SR);


		commandcode = 0x52;

		I2C_MasterSendData(&I2C1Handle, &commandcode, 1, SLAVE_ADDR, I2C_ENABLE_SR);

		I2C_MasterReceiveData(&I2C1Handle, rcv_buf, len, SLAVE_ADDR, I2C_ENABLE_SR);

		rcv_buf[len+1] = '\0';

		printf("Data : %s", rcv_buf);
	}
}
